Configuration/Documents/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Задача</Name>
			<BasedOn>
				<xr:Item>Document.ВходящееПисьмо</xr:Item>
				<xr:Item>Document.ИсходящееПисьмо</xr:Item>
				<xr:Item>Document.Задача</xr:Item>
				<xr:Item>Document.ДействиеЗадачи</xr:Item>
				<xr:Item>Document.Бронь</xr:Item>
				<xr:Item>Catalog.ГруппировкиЗадач</xr:Item>
				<xr:Item>Catalog.СтруктураПредприятия</xr:Item>
				<xr:Item>Catalog.Пользователи</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Catalog.ДокументыПредприятия</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Мероприятия</xr:Item>
				<xr:Item>Catalog.СообщенияОбсуждений</xr:Item>
				<xr:Item>Catalog.Файлы</xr:Item>
				<xr:Item>Catalog.ТемыОбсуждений</xr:Item>
				<xr:Item>Catalog.ШаблоныЗадач</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КоличествоЗадачПоАвторам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияОбновления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриложения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидПриложенияЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВышестоящаяЗадача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВышестоящееДействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоОтменил</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеФорматированное</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПриложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПриложенийЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоемкостьДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоемкостьОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоемкостьСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Флаг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФлагиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приложение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПриложениеЗадач</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидУчастника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыУчастниковЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнешнийИдентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействиеУчастника</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/Documents/ДействиеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДействиеЗадачи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КоличествоЗадачПоИсполнителям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияОбновления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчастника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОсобыйСрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПриложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВИсточнике</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникДействийЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоОтметил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПричинаВозврата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобоеОписаниеФорматированное</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеПричиныВозврата</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыйАвтор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыйЗаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДействияТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеУчастникаЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФактическиеИсполнители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Флаг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФлагиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приложение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПриложениеОтчетовОбИсполнении</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/CommonModules/КэшиНаВремяВызоваПовтИсп/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Кэши на время взова, для оптимизации работы (сервер, повторное использование).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует кеш области просмотра.
// 
// Возвращаемое значение:
//  Структура - Кеш области просмотра:
//   *  Заполнен - Булево.
//   *  Задача - ДокументСсылка.Задача.
//   *  ЗадачаОбъект - ДокументОбъект.Задача, Неопределено - Задача.
//   *  ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи.
//   *  РеквизитыДействияЗадачи - Структура, Неопределено - Реквизиты действия задачи.
//
Функция КэшЗадачаОбластьПросмотра() Экспорт
	
	КэшОбластиПросмотра = Новый Структура;
	КэшОбластиПросмотра.Вставить("Заполнен", Ложь);
	КэшОбластиПросмотра.Вставить("Задача", Документы.Задача.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("ЗадачаОбъект", Неопределено);
	КэшОбластиПросмотра.Вставить("ДействиеЗадачи", Документы.ДействиеЗадачи.ПустаяСсылка());
	КэшОбластиПросмотра.Вставить("РеквизитыДействияЗадачи", Неопределено);
	
	Возврат КэшОбластиПросмотра;
	
КонецФункции

// Кэш для формы элементы справочника документы предприятия.
// 
// Возвращаемое значение:
//  Структура - Кэш для формы элементы справочника документы предприятия:
//   * Инициализирован - Булево - Кэш инициализирован.
//   * КэшДокумента - Структура - Кэш документа:
//     ** Ссылка - СправочникСсылка.ДокументыПредприятия.
//     ** ВидДокумента - СправочникСсылка.ВидыДокументов.
//     ** Шаблон - СправочникСсылка.ШаблоныДокументов.
//     ** ЕстьФайлыШаблона - Булево.
//     ** Контрагент - СправочникСсылка.Контрагенты.
//     ** ПодписалОтКонтрагента - СправочникСсылка.КонтактныеЛица.
//     ** ДатаСоздания - Дата.
//     ** ДатаРегистрации - Дата.
//     ** Стороны - ТабличнаяЧасть.
//   * КэшВидаДокумента - Структура - Кэш вида документа. См. Делопроизводство.КэшВидаДокумента.
//   * УчастникиРабочейГруппы - См. РегистрыСведений.РабочиеГруппы.ПолучитьУчастниковПоОбъекту.
//   * ВсеСостоянияДокумента - См. Делопроизводство.ПолучитьВсеСостоянияДокумента.
//   * КэшОбработки - Структура - Кэш обработки:
//     ** Ссылка - СправочникСсылка.ОбработкиОбъектов.
//     ** ДатаСоздания - Дата.
//     ** Состояние - ПеречислениеСсылка.СостоянияОбработкиОбъектов.
//     ** ДатаИзмененияСостояния - Дата.
//     ** ДатаНачала - Дата.
//
Функция КэшДокументыПредприятияФормаЭлемента() Экспорт
	
	КэшДокументыПредприятияФормаЭлемента = Новый Структура;
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("Инициализирован", Ложь);
	
	КэшДокумента = Новый Структура;
	КэшДокумента.Вставить("Ссылка");
	КэшДокумента.Вставить("ВидДокумента");
	КэшДокумента.Вставить("Шаблон");
	КэшДокумента.Вставить("ЕстьФайлыШаблона");
	КэшДокумента.Вставить("Контрагент");
	КэшДокумента.Вставить("ПодписалОтКонтрагента");
	КэшДокумента.Вставить("ДатаСоздания");
	КэшДокумента.Вставить("ДатаРегистрации");
	КэшДокумента.Вставить("Стороны");
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшДокумента", КэшДокумента);
	
	КэшВидаДокумента = Делопроизводство.КэшВидаДокумента(Справочники.ВидыДокументов.ПустаяСсылка());
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшВидаДокумента", КэшВидаДокумента);
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("УчастникиРабочейГруппы", Новый ТаблицаЗначений);
	
	КэшДокументыПредприятияФормаЭлемента.Вставить("ВсеСостоянияДокумента", Новый ТаблицаЗначений);
	
	КэшОбработки = Новый Структура;
	КэшОбработки.Вставить("Ссылка");
	КэшОбработки.Вставить("ДатаСоздания");
	КэшОбработки.Вставить("Состояние");
	КэшОбработки.Вставить("ДатаИзмененияСостояния");
	КэшОбработки.Вставить("ДатаНачала");
	КэшДокументыПредприятияФормаЭлемента.Вставить("КэшОбработки", КэшОбработки);
	
	Возврат КэшДокументыПредприятияФормаЭлемента;
	
КонецФункции

// Получает цвет стиля по имени.
//
// Параметры:
//  ИмяЦветаСтиля - Строка
// 
// Возвращаемое значение:
//  Цвет
//
Функция ЦветСтиля(ИмяЦветаСтиля) Экспорт
	
	Возврат ЦветаСтиля[ИмяЦветаСтиля];
	
КонецФункции

// Кэш графиков работы отчета "Сводка работ".
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.Сотрудники
//   * Значение - СправочникСсылка.ГрафикиРаботы
//
Функция КэшГрафиковРаботы() Экспорт
	
	КэшГрафиковРаботы = Новый Соответствие;
	
	Возврат КэшГрафиковРаботы;
	
КонецФункции

// Кэш рабочих дней отчета "Сводка работ".
//
// Параметры:
//  ГрафикРаботы - СправочникСсылка.ГрафикиРаботы
// 
// Возвращаемое значение:
//  Структура:
//   * ЗаполненныеГода - Соответствие из КлючИЗначение:
//    ** Ключ - Число - Год.
//    ** Значение - Булево - Истина, если заполнено.
//   * РабочиеДни - Соответствие из КлючИЗначение:
//    ** Ключ - Дата - Начало дня.
//    ** Значение - Булево - Это рабочий день.
//   * КоличествоРабочихДней - Соответствие из КлючИЗначение:
//    ** Ключ - Дата - Начало дня.
//    ** Значение - Число - Количество рабочих дней относительно начала отсчёта.
//   * НачалоОтсчета - Дата.
//
Функция КэшРабочихДней(ГрафикРаботы) Экспорт
	
	КэшРабочихДней = Новый Структура;
	КэшРабочихДней.Вставить("ЗаполненныеГода", Новый Соответствие);
	КэшРабочихДней.Вставить("РабочиеДни", Новый Соответствие);
	КэшРабочихДней.Вставить("КоличествоРабочихДней", Новый Соответствие);
	КэшРабочихДней.Вставить("НачалоОтсчета", Дата(1, 1, 1));
	
	Возврат КэшРабочихДней;
	
КонецФункции

#КонецОбласти
